podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/FTM0_S32K142.svd.xml
            <register>
               <name>EXTTRIG</name>
               <description>FTM External Trigger</description>
               <addressOffset>0x6C</addressOffset>
               <fields>
                  <field>
                     <name>CH2TRIG</name>
                     <description>Channel 2 External Trigger Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>The generation of this external trigger is disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>The generation of this external trigger is enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="CH2TRIG" > <name>CH3TRIG</name> <description>Channel 3 External Trigger Enable</description> <bitOffset>1</bitOffset> </field>
                  <field derivedFrom="CH2TRIG" > <name>CH4TRIG</name> <description>Channel 4 External Trigger Enable</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="CH2TRIG" > <name>CH5TRIG</name> <description>Channel 5 External Trigger Enable</description> <bitOffset>3</bitOffset> </field>
                  <field derivedFrom="CH2TRIG" > <name>CH0TRIG</name> <description>Channel 0 External Trigger Enable</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="CH2TRIG" > <name>CH1TRIG</name> <description>Channel 1 External Trigger Enable</description> <bitOffset>5</bitOffset> </field>
                  <field>
                     <name>INITTRIGEN</name>
                     <description>Initialization Trigger Enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>The generation of initialization trigger is disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>The generation of initialization trigger is enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TRIGF</name>
                     <description>Channel Trigger Flag</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>No channel trigger was generated</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>A channel trigger was generated</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="CH2TRIG" > <name>CH6TRIG</name> <description>Channel 6 External Trigger Enable</description> <bitOffset>8</bitOffset> </field>
                  <field derivedFrom="CH2TRIG" > <name>CH7TRIG</name> <description>Channel 7 External Trigger Enable</description> <bitOffset>9</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>POL</name>
               <description>Channels Polarity</description>
               <addressOffset>0x70</addressOffset>
               <fields>
                  <field>
                     <name>POL0</name>
                     <description>Channel 0 Polarity</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>The channel polarity is active high</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>The channel polarity is active low</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="POL0" > <name>POL1</name> <description>Channel 1 Polarity</description> <bitOffset>1</bitOffset> </field>
                  <field derivedFrom="POL0" > <name>POL2</name> <description>Channel 2 Polarity</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="POL0" > <name>POL3</name> <description>Channel 3 Polarity</description> <bitOffset>3</bitOffset> </field>
                  <field derivedFrom="POL0" > <name>POL4</name> <description>Channel 4 Polarity</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="POL0" > <name>POL5</name> <description>Channel 5 Polarity</description> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="POL0" > <name>POL6</name> <description>Channel 6 Polarity</description> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="POL0" > <name>POL7</name> <description>Channel 7 Polarity</description> <bitOffset>7</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>FMS</name>
               <description>Fault Mode Status</description>
               <addressOffset>0x74</addressOffset>
               <fields>
                  <field>
                     <name>FAULTF0</name>
                     <description>Fault Detection Flag 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>No fault condition was detected at the fault input</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>A fault condition was detected at the fault input</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="FAULTF0" > <name>FAULTF1</name> <description>Fault Detection Flag 1</description> <bitOffset>1</bitOffset> </field>
                  <field derivedFrom="FAULTF0" > <name>FAULTF2</name> <description>Fault Detection Flag 2</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="FAULTF0" > <name>FAULTF3</name> <description>Fault Detection Flag 3</description> <bitOffset>3</bitOffset> </field>
                  <field>
                     <name>FAULTIN</name>
                     <description>Fault Inputs</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>The logic OR of the enabled fault inputs is 0</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>The logic OR of the enabled fault inputs is 1</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WPEN</name>
                     <description>Write Protection Enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Write protection is disabled. Write protected bits can be written</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Write protection is enabled. Write protected bits cannot be written</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FAULTF</name>
                     <description>Fault Detection Flag</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>No fault condition was detected</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>A fault condition was detected</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>FILTER</name>
               <description>Input Capture Filter Control</description>
               <addressOffset>0x78</addressOffset>
               <fields>
                  <field>
                     <name>CH0FVAL</name>
                     <description>Channel 0 Input Filter</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>CH1FVAL</name>
                     <description>Channel 1 Input Filter</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>CH2FVAL</name>
                     <description>Channel 2 Input Filter</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>CH3FVAL</name>
                     <description>Channel 3 Input Filter</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLTCTRL</name>
               <description>Fault Control</description>
               <addressOffset>0x7C</addressOffset>
               <fields>
                  <field>
                     <name>FAULT0EN</name>
                     <description>Fault Input 0 Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Fault input is disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Fault input is enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="FAULT0EN" > <name>FAULT1EN</name> <description>Fault Input 1 Enable</description> <bitOffset>1</bitOffset> </field>
                  <field derivedFrom="FAULT0EN" > <name>FAULT2EN</name> <description>Fault Input 2 Enable</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="FAULT0EN" > <name>FAULT3EN</name> <description>Fault Input 3 Enable</description> <bitOffset>3</bitOffset> </field>
                  <field>
                     <name>FFLTR0EN</name>
                     <description>Fault Input 0 Filter Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Fault input filter is disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Fault input filter is enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="FFLTR0EN" > <name>FFLTR1EN</name> <description>Fault Input 1 Filter Enable</description> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="FFLTR0EN" > <name>FFLTR2EN</name> <description>Fault Input 2 Filter Enable</description> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="FFLTR0EN" > <name>FFLTR3EN</name> <description>Fault Input 3 Filter Enable</description> <bitOffset>7</bitOffset> </field>
                  <field>
                     <name>FFVAL</name>
                     <description>Fault Input Filter</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>FSTATE</name>
                     <description>Fault output state</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>FTM outputs will be placed into safe values when fault events in ongoing (defined by POL bits)</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>FTM outputs will be tri-stated when fault event is ongoing</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>QDCTRL</name>
               <description>Quadrature Decoder Control And Status</description>
               <addressOffset>0x80</addressOffset>
               <fields>
                  <field>
                     <name>QUADEN</name>
                     <description>Quadrature Decoder Mode Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Quadrature Decoder mode is disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Quadrature Decoder mode is enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TOFDIR</name>
                     <description>Timer Overflow Direction In Quadrature Decoder Mode</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>TOF bit was set on the bottom of counting. There was an FTM counter decrement and FTM counter changes from its minimum value (CNTIN register) to its maximum value (MOD register)</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>TOF bit was set on the top of counting. There was an FTM counter increment and FTM counter changes from its maximum value (MOD register) to its minimum value (CNTIN register)</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>QUADIR</name>
                     <description>FTM Counter Direction In Quadrature Decoder Mode</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Counting direction is decreasing (FTM counter decrement)</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Counting direction is increasing (FTM counter increment)</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>QUADMODE</name>
                     <description>Quadrature Decoder Mode</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Phase A and phase B encoding mode</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Count and direction encoding mode</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PHBPOL</name>
                     <description>Phase B Input Polarity</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Normal polarity. Phase B input signal is not inverted before identifying the rising and falling edges of this signal</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Inverted polarity. Phase B input signal is inverted before identifying the rising and falling edges of this signal</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PHAPOL</name>
                     <description>Phase A Input Polarity</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Normal polarity. Phase A input signal is not inverted before identifying the rising and falling edges of this signal</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Inverted polarity. Phase A input signal is inverted before identifying the rising and falling edges of this signal</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PHBFLTREN</name>
                     <description>Phase B Input Filter Enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Phase B input filter is disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Phase B input filter is enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PHAFLTREN</name>
                     <description>Phase A Input Filter Enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Phase A input filter is disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Phase A input filter is enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
