podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/FTM0_S32K142.svd.xml
            <register>
               <name>C6V_MIRROR</name>
               <description>Mirror of Channel (n) Match Value</description>
               <addressOffset>0x21C</addressOffset>
               <fields>
                  <field>
                     <name>FRACVAL</name>
                     <description>Channel (n) Match Fractional Value</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>VAL</name>
                     <description>Mirror of the Channel (n) Match Integer Value</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>C7V_MIRROR</name>
               <description>Mirror of Channel (n) Match Value</description>
               <addressOffset>0x220</addressOffset>
               <fields>
                  <field>
                     <name>FRACVAL</name>
                     <description>Channel (n) Match Fractional Value</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>VAL</name>
                     <description>Mirror of the Channel (n) Match Integer Value</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
